snlkuharlocal/src/Catalogs/ВидыНормРасходаМатериалов/ВидыНормРасходаМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНормРасходаМатериалов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяНормыРасхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецНормыРасхода</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеНормыРасхода</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ВидыНормРасходаМатериалов/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//Кухарь 29.03.17 начало
	если не ЭтоГруппа тогда
		//Кухарь 29.03.17 конец
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНормРасходаМатериалов.Ссылка
		|ИЗ
		|	Справочник.ВидыНормРасходаМатериалов КАК ВидыНормРасходаМатериалов
		|ГДЕ
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода = &ВладелецНормыРасхода
		|	И ВидыНормРасходаМатериалов.ИмяНормыРасхода = &ИмяНормыРасхода
		|	И ВидыНормРасходаМатериалов.Код <> &Код";
		запрос.УстановитьПараметр("ВладелецНормыРасхода",ВладелецНормыРасхода);
		запрос.УстановитьПараметр("ИмяНормыРасхода",ИмяНормыРасхода);
		запрос.УстановитьПараметр("Код",Код);
		результат=запрос.Выполнить().выбрать();
		пока результат.Следующий() цикл
			#Если клиент тогда
				Сообщить("Эта норма на эту позицию уже установлена. Отредактируйте уже существующую норма, а не создавайте новую. Код старой нормы - "+результат.ссылка.код);
			#КонецЕсли
		КонецЦикла;
		//Кухарь 29.03.17 начало
	КонецЕсли;
	//Кухарь 29.03.17 конец
	

				 
КонецПроцедуры
